Repository: kodi-game/game.libretro.supafaust
Catalog: game.libretro.supafaust/resources/language/resource.language.*/strings.po
Languages: da_dk, es_es, ga, sv_se, zh_cn

# Addon Summary
source: Nintendo - SNES / SFC (Beetle Supafaust)
zh_cn: 任天堂 - SNES / SFC (Beetle Supafaust)

# Addon Description
source: Supafaust is a SNES emulator for multicore ARM Linux platforms. It is particularly suitable for low-end devices.
da_dk: Supafaust er en SNES-emulator til multikerne ARM Linux-platforme. Den er især velegnet til enheder, der ikke er kraftige.
es_es: Supafaust es un emulador de SNES para plataformas Linux ARM multinúcleo. Está especialmente indicado para dispositivos de gama baja.
ga: Is aithriseoir SNES é Supafaust do ardáin ilchroí ARM Linux. Tá sé oiriúnach go háirithe do ghléasanna íseal-deireadh.
sv_se: Supafaust är en SNES-emulator för flerkärniga ARM Linux-plattformar. Den är särskilt lämplig för svagare enheter.
zh_cn: Supafaust 是一个用于多核 ARM Linux 平台的 SNES 模拟器。它特别适用于低端设备。

# #30000
source: Settings
da_dk: Indstillinger
es_es: Ajustes
zh_cn: 设置

# #30001
source: Pixel format
es_es: Formato de Píxel
ga: Formáid picteilín
sv_se: Bildpunktsformat
zh_cn: 像素格式

# #30002
source: Correct pixel aspect ratio
da_dk: Korrekt billedformat for pixel
es_es: Relación de Aspecto Correcta de los Píxeles
ga: Cóimheas gné picteilín ceart
sv_se: Korrekt bildpunktsförhållande
zh_cn: 正确的像素纵横比

# #30003
source: Horizontal blend/double filter
da_dk: Vandret blandings-/dobbelt-filter
es_es: Mezcla Horizontal/Doble Filtro
ga: Cumasc cothrománach/scagaire dúbailte
sv_se: Horisontell blandning/dubbelfilter
zh_cn: 水平混合/双过滤器

# #30004
source: Deinterlacer
es_es: Desentrelazador
ga: Dí-idirfhíseáil
zh_cn: 逐行扫描

# #30005
source: First displayed scanline in NTSC mode
da_dk: Først viste scanlinje i NTSC-tilstand
es_es: Primera Línea de Exploración Visible en Modo NTSC
ga: An chéad líne scanadh a thaispeántar i mód NTSC
sv_se: Första skanlinje som visas i NTSC-läge
zh_cn: NTSC 模式下第一条显示的扫描线

# #30006
source: Last displayed scanline in NTSC mode
da_dk: Sidst viste scanlinje i NTSC-tilstand
es_es: Última Línea de Exploración Visible en Modo NTSC
ga: An líne scanadh dheireanach a taispeánadh i mód NTSC
sv_se: Senast visade skanlinje i NTSC-läge
zh_cn: NTSC 模式下最后显示的扫描线

# #30007
source: First displayed scanline in PAL mode
da_dk: Først viste scanlinje i PAL-tilstand
es_es: Primera Línea de Exploración Visible en Modo PAL
ga: An chéad líne scanadh a thaispeántar i mód PAL
sv_se: Första skanlinje som visas i PAL-läge
zh_cn: PAL 模式下第一条显示的扫描线

# #30008
source: Last displayed scanline in PAL mode
da_dk: Sidst viste scanlinje i PAL-tilstand
es_es: Última Línea de Exploración Visible en Modo PAL
ga: An líne scanadh dheireanach a taispeánadh i mód PAL
sv_se: Senast visade skanlinje i PAL-läge
zh_cn: PAL 模式下最后显示的扫描线

# #30009
source: Region/Type of SNES to emulate
da_dk: Region/type af SNES der emuleres
es_es: Región/Tipo de SNES a Emular
ga: Réigiún/Cineál SNES le haithris
sv_se: Region/Typ av SNES som ska emuleras
zh_cn: 要仿真的 SNES 的区域/类型

# #30010
source: Begin frame in SNES VBlank to lower latency
da_dk: Start-frame i SNES VBlank for at reducere latency
es_es: Inicio de Fotograma en SNES VBlank para Reducir la Latencia
ga: Tosaigh an fráma i SNES VBlank chun an latency a ísliú
sv_se: Börja bildrutan i SNES VBlank för att minska latensen
zh_cn: 在 SNES VBlank 中开始帧以降低延迟

# #30011
source: Enable 1-frame run-ahead
da_dk: Aktiver 1-frame forudkørsel
es_es: Activar Avance de 1 Fotograma
ga: Cumasaigh rith 1-fhráma chun tosaigh
sv_se: Aktivera 1-frame run-ahead
zh_cn: 启用1帧预演

# #30012
source: Enable multitap
da_dk: Aktiver multitap
es_es: Activar Multitap
ga: Cumasaigh il-thapáil
sv_se: Aktivera multitap
zh_cn: 启用多插转换器

# #30013
source: CX4 clock rate %
da_dk: CS4 clock-frekvens %
es_es: Frecuencia de Reloj CX4 %
ga: Ráta cloig CX4 %
sv_se: CX4 klockfrekvens %
zh_cn: CX4 时钟速率 %

# #30014
source: SuperFX clock rate %
da_dk: SuperFX clock-frekvens %
es_es: Frecuencia de reloj de SuperFX %
ga: Ráta cloig SuperFX %
sv_se: SuperFX klockfrekvens %
zh_cn: SuperFX 时钟速率 %

# #30015
source: Emulate SuperFX instruction cache
da_dk: Emuler SuperFX-instruktionscache
es_es: Emular caché de instrucciones de SuperFX
ga: Aithris taisce treoracha SuperFX
sv_se: Emulera SuperFX instruktionscache
zh_cn: 模拟 SuperFX 指令缓存

# #30016
source: Internal resampler(output rate)
da_dk: Intern resampler (udgangsfrekvens)
es_es: Resampler Interno (tasa de salida)
ga: Athshamplóir inmheánach (ráta aschuir)
sv_se: Intern omsamplare (utgångsfrekvens)
zh_cn: 内部重采样器（输出速率）

# #30017
source: Emulation thread affinity mask
da_dk: Affinitetsmaske til emuleringstråden
es_es: Máscara de Afinidad del Hilo de Emulación
ga: Masc gaolmhaireachta snáithe aithrise
sv_se: Affinitetsmask för emuleringstråd
zh_cn: 仿真线程关联掩码

# #30018
source: PPU render thread affinity mask
da_dk: Affinitetsmaske til PPU renderingstråd
es_es: Máscara de Afinidad de Subprocesos de Renderizado PPU
ga: Masc cleamhnais rindreála PPU
sv_se: PPU-renderingstråd affinitetsmask
zh_cn: PPU 渲染线程关联掩码

# #30019
source: PPU renderer
es_es: Renderizador PPU
ga: Rindreálaí PPU
sv_se: PPU-renderare
zh_cn: PPU 渲染器
